In [1]:
import pandas as pd

In [2]:
customers = pd.read_csv("E:\Guvi\Projects\Data Spark\Customers.csv", encoding='latin1')
# Used encoding="latin1" because UnicodeDecodeError: 'utf-8' codec can't decode byte 0xfc in position 5460: invalid start byte

In [3]:
customers.head()

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,7/3/1939
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,9/27/1979
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,5/26/1947
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,9/17/1957
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,11/19/1965

In [4]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15266 entries, 0 to 15265
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CustomerKey  15266 non-null  int64
 1   Gender       15266 non-null  object
 2   Name         15266 non-null  object
 3   City         15266 non-null  object
 4   State Code   15256 non-null  object
 5   State        15266 non-null  object
 6   Zip Code     15266 non-null  object
 7   Country      15266 non-null  object
 8   Continent    15266 non-null  object
 9   Birthday     15266 non-null  object
dtypes: int64(1), object(9)
memory usage: 1.2+ MB

In [5]:
customers.isnull().sum()

CustomerKey     0
Gender          0
Name            0
City            0
State Code     10
State           0
Zip Code        0
Country         0
Continent       0
Birthday        0
dtype: int64

In [6]:
def generate_state_code(state_name):
    state_words = state_name.split()
    if len(state_words) == 1:
        state_code = state_words[0][:3].upper()
    else:
        state_code = ''.join([word[0].upper() for word in state_words])
    return state_code

In [7]:
customers.loc[customers['State Code'].isnull(), 'State Code'] = customers['State'].apply(generate_state_code)

In [8]:
customers.isnull().sum()

CustomerKey    0
Gender         0
Name           0
City           0
State Code     0
State          0
Zip Code       0
Country        0
Continent      0
Birthday       0
dtype: int64

In [9]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15266 entries, 0 to 15265
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CustomerKey  15266 non-null  int64
 1   Gender       15266 non-null  object
 2   Name         15266 non-null  object
 3   City         15266 non-null  object
 4   State Code   15266 non-null  object
 5   State        15266 non-null  object
 6   Zip Code     15266 non-null  object
 7   Country      15266 non-null  object
 8   Continent    15266 non-null  object
 9   Birthday     15266 non-null  object
dtypes: int64(1), object(9)
memory usage: 1.2+ MB

In [10]:
customers['Birthday'] = pd.to_datetime(customers['Birthday'])

In [11]:
customers['Gender'] = customers['Gender'].astype('category')

In [12]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15266 entries, 0 to 15265
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CustomerKey  15266 non-null  int64
 1   Gender       15266 non-null  category
 2   Name         15266 non-null  object
 3   City         15266 non-null  object
 4   State Code   15266 non-null  object
 5   State        15266 non-null  object
 6   Zip Code     15266 non-null  object
 7   Country      15266 non-null  object
 8   Continent    15266 non-null  object
 9   Birthday     15266 non-null  datetime64[ns]
dtypes: category(1), datetime64[ns](1), int64(1), object(7)
memory usage: 1.1+ MB

In [13]:
customers.to_csv(r"E:\Guvi\Projects\Data Spark\cleaned_customers.csv", index=False)

In [14]:
cleaned_customers = pd.read_csv("E:\Guvi\Projects\Data Spark\cleaned_customers.csv")

In [15]:
cleaned_customers.head()

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,1939-07-03
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,1979-09-27
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,1947-05-26
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,1957-09-17
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,1965-11-19

In [16]:
products = pd.read_csv("E:\Guvi\Projects\Data Spark\Products.csv")

In [17]:
products.head()

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,$6.62,$12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,$6.62,$12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,$7.40,$14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,$11.00,$21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,$11.00,$21.57,101,MP4&MP3,1,Audio

In [18]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ProductKey      2517 non-null   int64
 1   Product Name    2517 non-null   object
 2   Brand           2517 non-null   object
 3   Color           2517 non-null   object
 4   Unit Cost USD   2517 non-null   object
 5   Unit Price USD  2517 non-null   object
 6   SubcategoryKey  2517 non-null   int64
 7   Subcategory     2517 non-null   object
 8   CategoryKey     2517 non-null   int64
 9   Category        2517 non-null   object
dtypes: int64(3), object(7)
memory usage: 196.8+ KB

In [19]:
products.isnull().sum()

ProductKey        0
Product Name      0
Brand             0
Color             0
Unit Cost USD     0
Unit Price USD    0
SubcategoryKey    0
Subcategory       0
CategoryKey       0
Category          0
dtype: int64

In [20]:
products['Unit Cost USD'] = products['Unit Cost USD'].str.replace(r'[\$,]', '', regex=True)

In [21]:
products['Unit Cost USD'] = products['Unit Cost USD'].astype(float)

In [22]:
products['Unit Price USD'] = products['Unit Price USD'].str.replace(r'[\$,]', '', regex=True)

In [23]:
products['Unit Price USD'] = products['Unit Price USD'].astype(float)

In [24]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ProductKey      2517 non-null   int64
 1   Product Name    2517 non-null   object
 2   Brand           2517 non-null   object
 3   Color           2517 non-null   object
 4   Unit Cost USD   2517 non-null   float64
 5   Unit Price USD  2517 non-null   float64
 6   SubcategoryKey  2517 non-null   int64
 7   Subcategory     2517 non-null   object
 8   CategoryKey     2517 non-null   int64
 9   Category        2517 non-null   object
dtypes: float64(2), int64(3), object(5)
memory usage: 196.8+ KB

In [25]:
products.to_csv(r"E:\Guvi\Projects\Data Spark\cleaned_products.csv", index=False)

In [26]:
cleaned_products = pd.read_csv("E:\Guvi\Projects\Data Spark\cleaned_products.csv")

In [27]:
cleaned_products.head()

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,6.62,12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,6.62,12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,7.40,14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,11.00,21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,11.00,21.57,101,MP4&MP3,1,Audio

In [28]:
sales = pd.read_csv("E:\Guvi\Projects\Data Spark\Sales.csv")

In [29]:
sales.head()

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,1/1/2016,NaN,265598,10,1304,1,CAD
1,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD
2,366001,2,1/1/2016,1/13/2016,1269051,0,2007,1,USD
3,366002,1,1/1/2016,1/12/2016,266019,0,1106,7,CAD
4,366002,2,1/1/2016,1/12/2016,266019,0,373,1,CAD

In [30]:
sales.isnull().sum()

Order Number         0
Line Item            0
Order Date           0
Delivery Date    49719
CustomerKey          0
StoreKey             0
ProductKey           0
Quantity             0
Currency Code        0
dtype: int64

In [31]:
sales = sales.drop(['Delivery Date'], axis = 1)

In [32]:
sales.head()

,Order Number,Line Item,Order Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,1/1/2016,265598,10,1304,1,CAD
1,366001,1,1/1/2016,1269051,0,1048,2,USD
2,366001,2,1/1/2016,1269051,0,2007,1,USD
3,366002,1,1/1/2016,266019,0,1106,7,CAD
4,366002,2,1/1/2016,266019,0,373,1,CAD

In [33]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order Number   62884 non-null  int64
 1   Line Item      62884 non-null  int64
 2   Order Date     62884 non-null  object
 3   CustomerKey    62884 non-null  int64
 4   StoreKey       62884 non-null  int64
 5   ProductKey     62884 non-null  int64
 6   Quantity       62884 non-null  int64
 7   Currency Code  62884 non-null  object
dtypes: int64(6), object(2)
memory usage: 3.8+ MB

In [34]:
sales['Order Date'] = sales['Order Date'].astype('datetime64[ns]')

In [35]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order Number   62884 non-null  int64
 1   Line Item      62884 non-null  int64
 2   Order Date     62884 non-null  datetime64[ns]
 3   CustomerKey    62884 non-null  int64
 4   StoreKey       62884 non-null  int64
 5   ProductKey     62884 non-null  int64
 6   Quantity       62884 non-null  int64
 7   Currency Code  62884 non-null  object
dtypes: datetime64[ns](1), int64(6), object(1)
memory usage: 3.8+ MB

In [36]:
sales.to_csv(r"E:\Guvi\Projects\Data Spark\cleaned_sales.csv", index=False)

In [37]:
cleaned_sales = pd.read_csv("E:\Guvi\Projects\Data Spark\cleaned_sales.csv")

In [38]:
cleaned_sales.head()

,Order Number,Line Item,Order Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,2016-01-01,265598,10,1304,1,CAD
1,366001,1,2016-01-01,1269051,0,1048,2,USD
2,366001,2,2016-01-01,1269051,0,2007,1,USD
3,366002,1,2016-01-01,266019,0,1106,7,CAD
4,366002,2,2016-01-01,266019,0,373,1,CAD

In [39]:
stores = pd.read_csv("E:\Guvi\Projects\Data Spark\Stores.csv")

In [40]:
stores.head()

   StoreKey    Country                         State  Square Meters  Open Date
0         1  Australia  Australian Capital Territory          595.0   1/1/2008
1         2  Australia            Northern Territory          665.0  1/12/2008
2         3  Australia               South Australia         2000.0   1/7/2012
3         4  Australia                      Tasmania         2000.0   1/1/2010
4         5  Australia                      Victoria         2000.0  12/9/2015

In [41]:
stores.isnull().sum()

StoreKey         0
Country          0
State            0
Square Meters    1
Open Date        0
dtype: int64

In [42]:
stores['Square Meters'] = stores['Square Meters'].fillna(stores['Square Meters'].mean())

In [43]:
stores.isnull().sum()

StoreKey         0
Country          0
State            0
Square Meters    0
Open Date        0
dtype: int64

In [44]:
stores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67 entries, 0 to 66
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   StoreKey       67 non-null     int64
 1   Country        67 non-null     object
 2   State          67 non-null     object
 3   Square Meters  67 non-null     float64
 4   Open Date      67 non-null     object
dtypes: float64(1), int64(1), object(3)
memory usage: 2.7+ KB

In [45]:
stores['Open Date'] = stores['Open Date'].astype('datetime64[ns]')

In [46]:
stores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67 entries, 0 to 66
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   StoreKey       67 non-null     int64
 1   Country        67 non-null     object
 2   State          67 non-null     object
 3   Square Meters  67 non-null     float64
 4   Open Date      67 non-null     datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 2.7+ KB

In [47]:
stores.to_csv(r"E:\Guvi\Projects\Data Spark\cleaned_stores.csv", index=False)

In [48]:
cleaned_stores = pd.read_csv("E:\Guvi\Projects\Data Spark\cleaned_stores.csv")

In [49]:
cleaned_stores.head()

,StoreKey,Country,State,Square Meters,Open Date
0,1,Australia,Australian Capital Territory,595.0,2008-01-01
1,2,Australia,Northern Territory,665.0,2008-01-12
2,3,Australia,South Australia,2000.0,2012-01-07
3,4,Australia,Tasmania,2000.0,2010-01-01
4,5,Australia,Victoria,2000.0,2015-12-09

In [50]:
exchange_rates = pd.read_csv("E:\Guvi\Projects\Data Spark\Exchange_Rates.csv")

In [51]:
exchange_rates.head()

       Date Currency  Exchange
0  1/1/2015      USD    1.0000
1  1/1/2015      CAD    1.1583
2  1/1/2015      AUD    1.2214
3  1/1/2015      EUR    0.8237
4  1/1/2015      GBP    0.6415

In [52]:
exchange_rates.isnull().sum()

Date        0
Currency    0
Exchange    0
dtype: int64

In [53]:
exchange_rates.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11215 entries, 0 to 11214
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      11215 non-null  object
 1   Currency  11215 non-null  object
 2   Exchange  11215 non-null  float64
dtypes: float64(1), object(2)
memory usage: 263.0+ KB

In [54]:
exchange_rates['Date'] = exchange_rates['Date'].astype('datetime64[ns]')

In [55]:
exchange_rates.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11215 entries, 0 to 11214
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      11215 non-null  datetime64[ns]
 1   Currency  11215 non-null  object
 2   Exchange  11215 non-null  float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 263.0+ KB

In [56]:
exchange_rates.to_csv(r"E:\Guvi\Projects\Data Spark\cleaned_exchange_rates.csv", index=False)

In [57]:
cleaned_exchange_rates = pd.read_csv("E:\Guvi\Projects\Data Spark\cleaned_exchange_rates.csv")

In [58]:
cleaned_exchange_rates.head()

         Date Currency  Exchange
0  2015-01-01      USD    1.0000
1  2015-01-01      CAD    1.1583
2  2015-01-01      AUD    1.2214
3  2015-01-01      EUR    0.8237
4  2015-01-01      GBP    0.6415

In [59]:
pd.read_csv("E:\Guvi\Projects\Data Spark\cleaned_products.csv").info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ProductKey      2517 non-null   int64
 1   Product Name    2517 non-null   object
 2   Brand           2517 non-null   object
 3   Color           2517 non-null   object
 4   Unit Cost USD   2517 non-null   float64
 5   Unit Price USD  2517 non-null   float64
 6   SubcategoryKey  2517 non-null   int64
 7   Subcategory     2517 non-null   object
 8   CategoryKey     2517 non-null   int64
 9   Category        2517 non-null   object
dtypes: float64(2), int64(3), object(5)
memory usage: 196.8+ KB

In [60]:
# Replace any invalid CategoryKey with NaN or a valid integer value
products['CategoryKey'] = pd.to_numeric(products['CategoryKey'], errors='coerce')

In [61]:
products.to_csv(r"E:\Guvi\Projects\Data Spark\cleaned_products.csv", index=False)

In [62]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ProductKey      2517 non-null   int64
 1   Product Name    2517 non-null   object
 2   Brand           2517 non-null   object
 3   Color           2517 non-null   object
 4   Unit Cost USD   2517 non-null   float64
 5   Unit Price USD  2517 non-null   float64
 6   SubcategoryKey  2517 non-null   int64
 7   Subcategory     2517 non-null   object
 8   CategoryKey     2517 non-null   int64
 9   Category        2517 non-null   object
dtypes: float64(2), int64(3), object(5)
memory usage: 196.8+ KB

In [63]:
pd.read_csv("E:\Guvi\Projects\Data Spark\cleaned_products.csv").info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ProductKey      2517 non-null   int64
 1   Product Name    2517 non-null   object
 2   Brand           2517 non-null   object
 3   Color           2517 non-null   object
 4   Unit Cost USD   2517 non-null   float64
 5   Unit Price USD  2517 non-null   float64
 6   SubcategoryKey  2517 non-null   int64
 7   Subcategory     2517 non-null   object
 8   CategoryKey     2517 non-null   int64
 9   Category        2517 non-null   object
dtypes: float64(2), int64(3), object(5)
memory usage: 196.8+ KB

In [64]:
products['CategoryKey'].dtype

dtype('int64')

In [65]:
import pyodbc
import pandas as pd

# Load the CSV data into a pandas DataFrame
df = pd.read_csv("E:\Guvi\Projects\Data Spark\cleaned_products.csv")

# Clean column names (remove spaces, etc.)
df.columns = df.columns.str.replace(' ', '')  # Removes spaces from column names

# Setup the SQL Server connection
conn = pyodbc.connect('DRIVER={ODBC Driver 17 for SQL Server};'
                      'SERVER=PRAKASH\SQLSERVER;'
                      'DATABASE=GlobalElectronicsDB;'
                      'UID=PRAKASH\91701;'
                      'Trusted_Connection=yes')
cursor = conn.cursor()

# Check if data already exists (e.g., by checking the number of rows)
cursor.execute("SELECT COUNT(*) FROM Products")
row_count = cursor.fetchone()[0]

if row_count > 0:
    print("Data already loaded. Skipping insertion.")
else:
    for index, row in df.iterrows():
        cursor.execute('''
            INSERT INTO Products (ProductKey, ProductName, Brand, Color, UnitCostUSD, 
                                  UnitPriceUSD, SubcategoryKey, Subcategory, CategoryKey, Category)
            VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
        ''', 
        row['ProductKey'], row['ProductName'], row['Brand'], row['Color'], row['UnitCostUSD'], 
        row['UnitPriceUSD'], row['SubcategoryKey'], row['Subcategory'], row['CategoryKey'], row['Category'])

    conn.commit()
    print("Data inserted successfully!")

cursor.close()
conn.close()

Data already loaded. Skipping insertion.

In [66]:
import pyodbc
import pandas as pd

# Replace placeholders with your actual values
conn = pyodbc.connect('DRIVER={ODBC Driver 17 for SQL Server};'
                      'SERVER=PRAKASH\SQLSERVER;'
                      'DATABASE=GlobalElectronicsDB;'
                      'UID=PRAKASH\91701;'
                      'Trusted_Connection=yes') # Or use UID/PWD if SQL Authentication

cursor = conn.cursor()

In [67]:
# 1. Customer Demographics Analysis

In [68]:
query1 = '''
SELECT Country, Gender, COUNT(*) AS CustomerCount
FROM dbo.Customers
GROUP BY Country, Gender
ORDER BY CustomerCount DESC;
'''
df1 = pd.read_sql(query1, conn)
df1.head()

C:\Users\91701\AppData\Local\Temp\ipykernel_7076\3549442436.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df1 = pd.read_sql(query1, conn)

          Country  Gender  CustomerCount
0   United States    Male           3473
1   United States  Female           3355
2  United Kingdom    Male           1006
3  United Kingdom  Female            938
4          Canada    Male            798

In [69]:
# 2. Average Customer Age

In [70]:
query2 = '''
SELECT 
    ROUND(AVG(DATEDIFF(YEAR, Birthday, GETDATE())), 1) AS AverageAge
FROM dbo.Customers;
'''
df2 = pd.read_sql(query2, conn)
df2.head()

C:\Users\91701\AppData\Local\Temp\ipykernel_7076\118302460.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df2 = pd.read_sql(query2, conn)

   AverageAge
0          56

In [71]:
# 3. Total Orders and Average Order Value by Customer

In [72]:
query3 = '''
SELECT s.CustomerKey, 
       COUNT(*) AS TotalOrders,
       SUM(p.UnitPriceUSD * s.Quantity) AS TotalSpent,
       ROUND(AVG(p.UnitPriceUSD * s.Quantity), 2) AS AvgOrderValue
FROM dbo.Sales s
JOIN dbo.Products p ON s.ProductKey = p.ProductKey
GROUP BY s.CustomerKey;
'''
df3 = pd.read_sql(query3, conn)
df3.head()

C:\Users\91701\AppData\Local\Temp\ipykernel_7076\2496451935.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df3 = pd.read_sql(query3, conn)

   CustomerKey  TotalOrders  TotalSpent  AvgOrderValue
0       303506            7     7138.90        1019.84
1      1948125            3      578.65         192.88
2       632482            2     1222.24         611.12
3      1634778           15    21428.09        1428.54
4       972627            3     1795.95         598.65

In [73]:
# 4. Total Sales by Store

In [74]:
query4 = '''
SELECT st.StoreKey, 
       st.Country, 
       SUM(p.UnitPriceUSD * s.Quantity) AS TotalSales
FROM dbo.Sales s
JOIN dbo.Products p ON s.ProductKey = p.ProductKey
JOIN dbo.Stores st ON s.StoreKey = st.StoreKey
GROUP BY st.StoreKey, st.Country;
'''
df4 = pd.read_sql(query4, conn)
df4.head()

C:\Users\91701\AppData\Local\Temp\ipykernel_7076\693473652.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df4 = pd.read_sql(query4, conn)

   StoreKey  Country   TotalSales
0         0   Online  11404324.63
1        23  Germany    615040.59
2        29    Italy    913856.35
3         9   Canada   1336150.06
4        15   France    205119.67

In [75]:
# 5. Top 5 Products by Sales

In [76]:
query5 = '''
SELECT TOP 5 p.ProductName, 
              SUM(s.Quantity) AS TotalQuantitySold, 
              SUM(s.Quantity * p.UnitPriceUSD) AS TotalRevenue
FROM dbo.Sales s
JOIN dbo.Products p ON s.ProductKey = p.ProductKey
GROUP BY p.ProductName
ORDER BY TotalRevenue DESC;
'''
df5 = pd.read_sql(query5, conn)
df5.head()

C:\Users\91701\AppData\Local\Temp\ipykernel_7076\2920450821.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df5 = pd.read_sql(query5, conn)

,ProductName,TotalQuantitySold,TotalRevenue
0,WWI Desktop PC2.33 X2330 Black,550,505450.0
1,Adventure Works Desktop PC2.33 XD233 Silver,481,466089.0
2,Adventure Works Desktop PC2.33 XD233 Brown,479,464151.0
3,Adventure Works Desktop PC2.33 XD233 Black,462,447678.0
4,Adventure Works Desktop PC2.33 XD233 White,451,437019.0

In [77]:
# 6. Currency Exchange Impact on Sales

In [78]:
query6 = '''
SELECT s.CurrencyCode, 
       SUM(s.Quantity * p.UnitPriceUSD) AS TotalSalesInUSD,
       e.Exchange AS ExchangeRate,
       SUM(s.Quantity * p.UnitPriceUSD * e.Exchange) AS TotalSalesInLocalCurrency
FROM dbo.Sales s
JOIN dbo.Products p ON s.ProductKey = p.ProductKey
JOIN dbo.CurrencyExchangeRates e ON s.CurrencyCode = e.Currency
GROUP BY s.CurrencyCode, e.Exchange;
'''
df6 = pd.read_sql(query6, conn)
df6.head()

C:\Users\91701\AppData\Local\Temp\ipykernel_7076\2391158677.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df6 = pd.read_sql(query6, conn)

  CurrencyCode  TotalSalesInUSD  ExchangeRate  TotalSalesInLocalCurrency
0          AUD     2.708138e+06        1.4270               3.864512e+06
1          AUD     8.124413e+06        1.4381               1.168372e+07
2          GBP     7.084088e+06        0.6599               4.674790e+06
3          AUD     1.354069e+07        1.4007               1.896644e+07
4          CAD     1.417300e+07        1.1682               1.655690e+07

In [79]:
# 7. Product Profitability Analysis

In [80]:
query7 = '''
SELECT p.ProductName,
       SUM(p.UnitPriceUSD - p.UnitCostUSD) * SUM(s.Quantity) AS TotalProfit
FROM dbo.Sales s
JOIN dbo.Products p ON s.ProductKey = p.ProductKey
GROUP BY p.ProductName
ORDER BY TotalProfit DESC;
'''
df7 = pd.read_sql(query7, conn)
df7.head()

C:\Users\91701\AppData\Local\Temp\ipykernel_7076\142362846.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df7 = pd.read_sql(query7, conn)

                                   ProductName  TotalProfit
0               WWI Desktop PC2.33 X2330 Black   52049844.0
1  Adventure Works Desktop PC2.33 XD233 Silver   45502936.7
2   Adventure Works Desktop PC2.33 XD233 Black   45202287.9
3   Adventure Works Desktop PC2.33 XD233 Brown   44692999.2
4               WWI Desktop PC2.33 X2330 Brown   42684559.2

In [81]:
# 8. Sales Trends Over Time

In [82]:
query8 = '''
SELECT 
    YEAR(s.OrderDate) AS Year, 
    MONTH(s.OrderDate) AS Month, 
    SUM(s.Quantity * p.UnitPriceUSD) AS TotalSales
FROM dbo.Sales s
JOIN dbo.Products p ON s.ProductKey = p.ProductKey
GROUP BY YEAR(s.OrderDate), MONTH(s.OrderDate)
ORDER BY Year, Month;
'''
df8 = pd.read_sql(query8, conn)
df8.head()

C:\Users\91701\AppData\Local\Temp\ipykernel_7076\1508176568.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df8 = pd.read_sql(query8, conn)

   Year  Month  TotalSales
0  2016      1   649918.78
1  2016      2   891098.30
2  2016      3   338407.36
3  2016      4   110591.63
4  2016      5   595986.18

In [83]:
# 9. Store Performance Based on Square Meters

In [84]:
query9 = '''
SELECT st.StoreKey,
       st.Country,
       st.SquareMeters,
       SUM(s.Quantity * p.UnitPriceUSD) AS TotalSales
FROM dbo.Sales s
JOIN dbo.Products p ON s.ProductKey = p.ProductKey
JOIN dbo.Stores st ON s.StoreKey = st.StoreKey
GROUP BY st.StoreKey, st.Country, st.SquareMeters;
'''
df9 = pd.read_sql(query9, conn)
df9.head()

C:\Users\91701\AppData\Local\Temp\ipykernel_7076\2636435569.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df9 = pd.read_sql(query9, conn)

   StoreKey  Country  SquareMeters   TotalSales
0         0   Online    1402.19697  11404324.63
1        23  Germany    1365.00000    615040.59
2        29    Italy    1000.00000    913856.35
3         9   Canada    1500.00000   1336150.06
4        15   France     400.00000    205119.67

In [85]:
# 10. Customer Segmentation by Purchase Frequency

In [86]:
query10 = '''
SELECT s.CustomerKey, 
       COUNT(DISTINCT s.OrderNumber) AS PurchaseFrequency,
       CASE 
           WHEN COUNT(DISTINCT s.OrderNumber) >= 10 THEN 'Frequent Buyer'
           WHEN COUNT(DISTINCT s.OrderNumber) BETWEEN 5 AND 9 THEN 'Moderate Buyer'
           ELSE 'Occasional Buyer'
       END AS CustomerSegment
FROM dbo.Sales s
GROUP BY s.CustomerKey
ORDER BY PurchaseFrequency DESC;
'''
df10 = pd.read_sql(query10, conn)
df10.head()

C:\Users\91701\AppData\Local\Temp\ipykernel_7076\2547161648.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df10 = pd.read_sql(query10, conn)

   CustomerKey  PurchaseFrequency CustomerSegment
0       723572                 14  Frequent Buyer
1      2080484                 12  Frequent Buyer
2      1349131                 11  Frequent Buyer
3      1492176                 10  Frequent Buyer
4       793686                 10  Frequent Buyer

In [87]:
cursor.close()
conn.close()